#ifndef _TC377_config_h
#define _TC377_config_h

#define AURIX_MCU_FREQUENCY     300 * 1000 * 1000   //设置单片机频率为300M 可选设置 300M(默认频率)  240M(降频)  200M(降频)

//-------------------------------------------------------------------------------------------------------------------
//  PRINTF_ENABLE 为 0               不使用printf串口打印函数及不输出调试信息，则不会初始化相应串口
//  PRINTF_ENABLE 为 1               使用printf串口打印函数及输出调试信息，则会初始化相应串口，这里定义为1之后，无需自己手动初始化串口
//-------------------------------------------------------------------------------------------------------------------
#define PRINTF_ENABLE 1

#if (1 == PRINTF_ENABLE)

//-------------------------------------------------------------------------------------------------------------------
//printf串口打印函数所使用的串口、串口波特率、串口引脚宏定义
//-------------------------------------------------------------------------------------------------------------------
#define DEBUG_UART              UART_2
#define DEBUG_UART_BAUD         115200
#define DEBUG_UART_TX_PIN       UART2_TX_P33_9
#define DEBUG_UART_RX_PIN       UART2_RX_P33_8

//-------------------------------------------------------------------------------------------------------------------
//  DEBUG_INFO 为 0                  不输出断言信息
//  DEBUG_INFO 为 1                  输出断言信息，断言信息包含错误所在文件及所在行  需要PRINTF宏定义为1才能有效输出
//-------------------------------------------------------------------------------------------------------------------
#define DEBUG_PRINTF 1

#endif

#endif
